SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 2224b2
	Comment (
		Created with EngMexx V1.0.2
	)
	Type ( Engine )
	WagonShape ( "2200bh.s" )
	Size ( 2.65m 3.5m 12.8m )
	CentreOfGravity ( 0m 1.7m 0m )
	Mass ( 30t )
	WheelRadius ( 0.4m )
	InertiaTensor ( Box ( 2.65m 3.5m 12.8m ) )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingUniqueType ( "Scharfenberg" )
		CouplingHasRigidConnection (  )
		Velocity ( 1m/s )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 3cm )
	DerailRailForce ( 70kN )
	DerailBufferForce ( 40kN )
	NumWheels ( 4 )
	Friction (
		150N/m/s	1	52mph		80000N/m/s	1.2
		0N/rad/s	1	-1rad/s	0N/rad/s	1
	)
	AntiSlip (  )
	BrakeEquipmentType ( "ep_brake" )
	BrakeSystemType ( EP )
	MaxBrakeForce ( 0kN )
	EmergencyBrakeResMaxPressure ( 90 )
	TripleValveRatio ( 1 )
	MaxReleaseRate ( 20 )
	MaxApplicationRate ( 20 )
	MaxAuxilaryChargingRate ( 1 )
	EmergencyResCapacity ( 1 )
	EmergencyResChargingRate ( 1 )
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 50 )
	
	PassengerCapacity ( 280 )	

	Sound ( "..\\..\\KVB B80D\\Sound_B80D\\KVB_B80D_Eng.sms" )
)

Engine ( 2224b2
	Wagon ( "2224b2" )
	Type ( Electric )
	MaxPower ( 600kW )
	MaxForce ( 45kN )
	MaxContinuousForce ( 35kN )
	MaxVelocity ( 80km/h )
	MaxCurrent ( 470A )
	WheelRadius ( 0.5m )
	Vigilance ( 0 0 )
	Sanding ( 1mph )
	MaxSandingTime ( -1 )
	NumWheels ( 4 )

	AirBrakesAirCompressorPowerRating ( 4 )
	AirBrakesAirCompressorWattage ( 19000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.5 )
	AirBrakesCompressorRestartPressure ( 95 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 1 )
	AirBrakesMainMaxAirPressure ( 100 )
	AirBrakesMainMinResAirPressure ( 30 )
	AirBrakesMainResVolume ( 1 )
	EngineBrakesControllerMaxApplicationRate ( 10 )
	EngineBrakesControllerMaxReleaseRate ( 20 )
	EngineBrakesControllerEmergencyApplicationRate ( 10 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	EngineBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesControllerHasProportionalBrake ( 1 )
	TrainBrakesControllerMinPressureReduction ( 6 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 20 )
	TrainBrakesControllerEmergencyApplicationRate ( 10 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	TrainBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesProportionalBrakeLag ( 0.9 )

	DynamicBrakesMinUsableSpeed ( -87 )
	DynamicBrakesMaximumEffectiveSpeed ( -37 )
	DynamicBrakesMaximumForce ( 40kN )
	DynamicBrakesResistorCurrentLimit ( 500 )
	DynamicBrakesCutInSpeed ( -86 )
	DynamicBrakesFadingSpeed ( 37 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 87 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 2 )
	DynamicBrakeHasAutoBailOff ( 1 )
	BrakesTrainBrakeType ( EP )
	BrakesEngineControllers ( "Train,Dynamic" )
	CabView ( "B80DCab.cvf" )

	DoesHornTriggerBell ( 0 )

	VigilanceMonitor (
		MonitoringDeviceMonitorTimeLimit ( 30 )
		MonitoringDeviceAlarmTimeLimit ( 20 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)
	EmergencyStopMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 0 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnResetButton ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)
	OverspeedMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 5 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 106 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceDoesSuppressionReset ( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed ( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin ( 2 )
		MonitoringDeviceResetOnResetButton ( 0 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)

	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Brake_Train ( 0 1 1 0
			NumNotches ( 3
				Notch ( 0 0 TrainBrakesControllerReleaseStart )
				Notch ( 1 0 TrainBrakesControllerFullServiceStart )
				Notch ( 0 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Throttle ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.5 0.5 throttle dynamic )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 0 )
		Horn ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
		Wipers ( 0 1 0 )
	)

	Name ( "KVB 2224 B2" )
	Sound ( "..\\..\\KVB B80D\\Sound_B80D\\KVB_B80D_Cab.sms" )

	Description (
		"Stadtbahnwagen B100S der Kölner Verkehrs-Betriebe AG\n\n"+
		"Der Stadtbahnwagen B (kurz: B-Wagen) ist ein regelspuriges Hochflur-Stadtbahn-Fahrzeug, "+
		"von dem zwischen 1973 und 1996 insgesamt knapp 470 Exemplare gebaut wurden, die auf verschiedenen Stadtbahn-Netzen "+
		"in Nordrhein-Westfalen zum Einsatz kommen. Entwickelt wurde das Fahrzeug von der Düsseldorfer Waggonfabrik DUEWAG, "+
		"die auch den größten Teil baute. Im Allgemeinen handelt es sich dabei um 2,65 m breite und 28 m lange zweiteilige "+
		"Fahrzeuge auf drei Drehgestellen mit insgesamt sechs Achsen.\n\n"+
		"Ab 1984 beschafften Bonn und Köln weitere B-Serien. "+
		"Diese in Köln eingesetzte Serie, die Ende der 1980er Jahre entstand, hat nur einen Führerstand an einem Wagenende "+
		"(Serie 2200) und verkehrt nur in Doppeltraktion. Von diesem Typ lieferte die Berliner „Waggon-Union“ zehn Fahrzeuge nach Köln."
	)
)
